worrajak/nRF52840/STM32_LoRa_P2P.cpp
// ============================================================================
// STM32 LoRa P2P Sensor Node
// ============================================================================
// Hardware: STM32F103C8 (Blue Pill) + RFM95 LoRa Module
// Upload: ST-Link (SWD)
// Serial Ports:
//   - Serial1 (PA9=TX, PA10=RX) - Debug/Monitor @ 9600 baud
//   - Serial3 (PB10=TX, PB11=RX) - GPS Module (future use) @ 9600 baud
// BOOT0: Must be connected to GND (0) to run from Flash
// ============================================================================

#include <SPI.h>
#include <RH_RF95.h>
#include <RHReliableDatagram.h>
#include <Wire.h>
#include <Adafruit_Sensor.h>
#include <Adafruit_BME280.h>
#include <RTClib.h>
#include <SdFat.h>

// STM32 HAL for ADC
#ifdef STM32F1xx
#include "stm32f1xx_hal.h"
#endif

#define SEALEVELPRESSURE_HPA (1013.25)

// Crypto Key (Must be 16 chars for AES-128)
const char* FIXED_CRYPTO_KEY = "1234567890000000";

// LoRa Configuration Structure (P2P)
struct LoRaConfig {
    long freq = 923E6;           // Frequency: 923 MHz
    int spreadingFactor = 7;     // SF: 7
    long bandwidth = 125000;     // BW: 125 kHz (125E3)
    int codingRate = 5;          // CR: 5
    int txPower = 12;            // TX Power: 12 dBm (balanced for range & power saving)
    int syncWord = 0x12;         // Sync Word: 0x12
} loraConfig;

// Hardware Serial Configuration
// Serial1 (PA9/PA10) - Debug/Monitor
// Serial3 (PB10/PB11) - GPS Module (future use)
HardwareSerial Serial1(PA10, PA9);   // RX, TX - Debug
HardwareSerial Serial3(PB11, PB10);  // RX, TX - GPS

// OLED display configuration
#define OLED_ADDRESS      0x3C  // Typical I2C address for SSD1306 OLED
bool oled_found = false;

// Sensor configuration
Adafruit_BME280 bme; // I2C #define BME280_ADDRESS (0x76)

// RTC DS1307 configuration (I2C Address: 0x68)
RTC_DS1307 rtc;
bool rtc_found = false;

// SD Card configuration (using Software SPI to avoid conflict with LoRa)
// CS (NSS) - PA4, MOSI - PA7, MISO - PA6, SCK - PA5
#define SD_CS_PIN PA4
SdFat sd;
FsFile logFile;
bool sd_found = false;
char logFilename[] = "DATA.CSV";

// Ping-Pong Buffer for data logging
#define BUFFER_SIZE 512  // Size of each buffer (256 bytes each)
#define MAX_RECORDS 16   // Max records per buffer (~32 bytes per record)

struct LogRecord {
    char timestamp[20];  // "YYYY-MM-DD HH:MM:SS"
    char type[10];       // "TRANSMIT", "RECEIVE"
    char data[60];       // Node ID, RSSI, Temp, etc.
};

struct PingPongBuffer {
    LogRecord records[MAX_RECORDS];
    uint8_t recordCount;
    bool full;
};

// Two buffers for ping-pong operation
PingPongBuffer bufferA, bufferB;
PingPongBuffer* activeBuffer = &bufferA;    // Current write buffer
PingPongBuffer* standbyBuffer = &bufferB;   // To be written to SD
bool bufferSwapNeeded = false;

float temperature = 0;
float humidity = 0;
uint16_t tempC_int = 0;
uint8_t hum_int = 0;
uint16_t vbat_int = 0;  // Battery voltage in mV

#define DEBUG   // ⚠️ Comment out to save additional power
#define SLEEP

#define led      PB5   // External LED
#define VBAT_CHANNEL 16  // STM32F103 Internal VBAT/2 monitor (ADC1_IN16)
#define VREF_CHANNEL 17  // STM32F103 Internal 1.2V Reference (ADC1_IN17) - for VDD measurement
#define VDD_SENSE_PIN PA0  // Voltage divider pin for measuring VDD (R1=22k, R2=10k from VDD to GND)

// LoRa Radio SPI2 pins (using SPI2 on PB13/PB14/PB15)
#define RFM95_CS   PB12  // NSS
#define RFM95_RST  PA8   // Reset
#define RFM95_INT  PB1   // DIO0

// SPI2 will be configured in setup()

// Create an instance of the radio driver
RH_RF95 rf95(RFM95_CS, RFM95_INT);

// Create a reliable datagram manager instance
RHReliableDatagram manager(rf95, 1);

// This node's address (0-255)
// ใช้เพื่อบอกว่าข้อความมาจาก node ไหน (ระบุตัวเอง)
#define THIS_NODE_ADDRESS 104

// Broadcast address - ส่งให้ทุก node รับได้ (0xFF = 255 = broadcast)
// ไม่ส่งไปหา node เฉพาะ แต่ "ตะโกน" ให้ทุกคนได้ยิน
#define BROADCAST_ADDRESS 0xFF  // RH_BROADCAST_ADDRESS

// Buffer for receiving messages
uint8_t rxbuf[RH_RF95_MAX_MESSAGE_LEN];
uint8_t rxlen = sizeof(rxbuf);

int txInterval = 30;  // seconds between transmissions (30 sec for testing)

// Collision Avoidance Variables
uint8_t retryCount = 0;
const uint8_t MAX_RETRIES = 5;
const uint16_t BASE_BACKOFF = 1000;  // 1 second base backoff in ms

// Sequence Number for this node (increments on each transmission)
uint8_t txSequenceNum = 0;

// Forward declarations
void initBME280();
void initDS1307();
void initSD();
void logDataToBuffer(const char* type, const char* data);
void writeBufferToSD();
void swapBuffers();
void logDataToSD(const char* dataType, const char* message);
void displayRTCTime();
void setup_vdd_sensor();
void check_flash_size();
void initOLED();
void printLoRaConfig();
void receiveData();
void transmitData();
void processMessageQueue();

// Relay Memory - Track received messages to avoid duplicate relay
#define RELAY_MEMORY_SIZE 10  // Track last 10 messages
struct RelayCache {
    uint8_t sourceNode;      // Which node sent the original message
    uint8_t sequenceNum;     // Sequence number of the message
    uint32_t timestamp;      // When we received it
} relayMemory[RELAY_MEMORY_SIZE];
uint8_t relayCacheIndex = 0;

// Message Queue for Delayed Relay (Store messages with random delay)
#define MESSAGE_QUEUE_SIZE 5  // Max 5 messages in queue
struct MessageQueue {
    uint8_t data[RH_RF95_MAX_MESSAGE_LEN];  // Message data
    uint8_t len;              // Message length
    uint32_t sendTime;        // When to send (timestamp)
    bool inUse;               // Whether this slot is used
} messageQueue[MESSAGE_QUEUE_SIZE];

uint8_t messageQueueIndex = 0;  // Current index in circular queue

// RX/TX Priority Control - Prevent collision by blocking TX during RX
volatile bool isRxBusy = false;        // Flag indicating receiver is active
uint32_t rxStartTime = 0;              // Timestamp when RX started
const uint32_t RX_HOLD_TIME = 50;      // Hold TX for 50ms after RX completes (safety margin)
const uint32_t RX_TIMEOUT = 5000;      // Max 5 seconds in RX state (failsafe)

// CRC16 calculation
uint16_t calculateCRC16(uint8_t* data, uint8_t length) {
    uint16_t crc = 0xFFFF;
    for (int i = 0; i < length; i++) {
        crc ^= (uint16_t)data[i];
        for (int j = 0; j < 8; j++) {
            if (crc & 1) {
                crc = (crc >> 1) ^ 0xA001;
            } else {
                crc >>= 1;
            }
        }
    }
    return crc;
}

