worrajak/nRF52840/STM32_LoRa_P2P.cpp
struct {
  uint8_t Header1[2] = {0x01, 0x67};
  char temp[2];
  uint8_t Header2[2] = {0x01, 0x68};
  char humid[1];
  uint8_t Header3[2] = {0x01, 0x02};
  char vbat[2];  
  uint8_t Header4[2] = {0x01, 0x88};
  char gpsb[10];  
} mydata;

byte power;
byte rate2;

// GPS variables (placeholder)
float lat = 0;
float lon = 0;
float alt = 0;

#ifdef SLEEP
#include <stm32f1xx.h>

// Simple sleep functions using standard delay
uint32_t sleepTime;

void mdelay(int n, bool mode = false) {
  delay(n);  // Use standard Arduino delay
}

void msleep(uint32_t ms) {
  delay(ms);  // Use standard Arduino delay
}
#endif

unsigned long lastTxTime = 0;
bool txInProgress = false;

// I2C device scanner - checks if OLED or other I2C devices are available
bool checkI2CDevice(uint8_t address) {
    Wire.beginTransmission(address);
    uint8_t error = Wire.endTransmission();
    return (error == 0); // Returns true if device found (no error)
}

// Initialize OLED display if available
void initOLED() {
    Wire.setSDA(PB7);
    Wire.setSCL(PB6);
    Wire.begin();
    delay(100);
    
    // Check for OLED at address 0x3C
    if (checkI2CDevice(OLED_ADDRESS)) {
        oled_found = true;
        Serial1.println(F("[OLED] OK"));
    } else {
        oled_found = false;
    }
}

// Print LoRa configuration to Serial
void printLoRaConfig() {
    Serial1.print(F("\n[LoRa] "));
    Serial1.print(loraConfig.freq / 1000000);
    Serial1.print(F("MHz SF"));
    Serial1.print(loraConfig.spreadingFactor);
    Serial1.print(F(" BW"));
    Serial1.print(loraConfig.bandwidth / 1000);
    Serial1.print(F("kHz CR"));
    Serial1.print(loraConfig.codingRate);
    Serial1.print(F(" Pwr"));
    Serial1.print(loraConfig.txPower);
    Serial1.print(F("dBm Node:"));
    Serial1.print(THIS_NODE_ADDRESS);
    Serial1.println(F(" [BROADCAST]"));
}

// Function to set LoRa frequency
void setLoRaFrequency(long freq) {
    loraConfig.freq = freq;
    Serial1.print(F("LoRa Frequency set to: "));
    Serial1.print(freq);
    Serial1.println(F(" Hz"));
    rf95.setFrequency(freq / 1000000.0);  // Convert to MHz
}

// Function to set Spreading Factor
void setSpreadingFactor(int sf) {
    if (sf >= 7 && sf <= 12) {
        loraConfig.spreadingFactor = sf;
        Serial1.print(F("Spreading Factor set to: SF"));
        Serial1.println(sf);
        rf95.setSpreadingFactor(sf);
    } else {
        Serial1.println(F("Invalid SF! Use 7-12"));
    }
}

// Function to set Bandwidth
void setBandwidth(long bw) {
    loraConfig.bandwidth = bw;
    Serial1.print(F("Bandwidth set to: "));
    Serial1.print(bw);
    Serial1.println(F(" Hz"));
    // Convert to bandwidth code (125kHz=7, 250kHz=8, 500kHz=9)
    uint8_t bwCode = 7;  // Default 125 kHz
    if (bw == 250000) bwCode = 8;
    else if (bw == 500000) bwCode = 9;
    rf95.setSignalBandwidth(bw);
}

// Function to set Coding Rate
void setCodingRate(int cr) {
    if (cr >= 5 && cr <= 8) {
        loraConfig.codingRate = cr;
        Serial1.print(F("Coding Rate set to: "));
        Serial1.println(cr);
        // RadioHead uses 4/(4+n) format, where n is 1-4 for CR 5-8
        rf95.setCodingRate4(cr - 4);
    } else {
        Serial1.println(F("Invalid CR! Use 5-8"));
    }
}

// Function to set TX Power
void setTXPower(int power) {
    if (power >= 5 && power <= 20) {
        loraConfig.txPower = power;
        Serial1.print(F("TX Power set to: "));
        Serial1.print(power);
        Serial1.println(F(" dBm"));
        rf95.setTxPower(power, false);  // false = PA_PIN not used
    } else {
        Serial1.println(F("Invalid TX Power! Use 5-20 dBm"));
    }
}

// Simple Encryption using XOR with key repetition (works with binary data)
void encrypt_data(const char* plaintext, int len, uint8_t* output) {
    int keyLen = strlen(FIXED_CRYPTO_KEY);
    
    for (int i = 0; i < len; i++) {
        output[i] = plaintext[i] ^ FIXED_CRYPTO_KEY[i % keyLen];  // XOR operation
    }
}

// Simple Decryption using XOR with key repetition (same operation as encryption)
void decrypt_data(const uint8_t* ciphertext, int len, char* output) {
    int keyLen = strlen(FIXED_CRYPTO_KEY);
    
    for (int i = 0; i < len; i++) {
        output[i] = ciphertext[i] ^ FIXED_CRYPTO_KEY[i % keyLen];  // XOR operation
    }
    output[len] = '\0';  // Null terminate
}

// Read Supply Voltage (VDD)
// Battery voltage measurement disabled - STM32duino does not support internal VREF
// Testing showed CH16 (VBAT) and CH17 (VREF) both return 0
// External voltage divider method available but not used
// Returns nominal 3.3V for compatibility
uint16_t readSupplyVoltage() {
    // Return nominal voltage without measurement
    return 3300;  // 3.3V nominal
    
    /* Voltage divider method (requires hardware):
       VDD --[22k]--+--[10k]--GND, PA0 to junction
       
    uint32_t sum = 0;
    for (uint8_t i = 0; i < 4; i++) {
        sum += analogRead(VDD_SENSE_PIN);
        delay(2);
    }
    uint16_t adcValue = sum / 4;
    if (adcValue < 100) return 3300;
    uint16_t supplyMV = (adcValue * 10560UL) / 4096;
    if (supplyMV < 2700 || supplyMV > 3600) return 3300;
    return supplyMV;
    */
}

// Sensor monitoring
bool bme280_available = false;
uint32_t bme280_last_read = 0;
uint32_t bme280_last_error = 0;
const uint32_t BME280_TIMEOUT = 30000;  // 30 seconds timeout
const uint32_t BME280_RETRY_INIT = 60000;  // Retry init every 60 seconds
uint8_t bme280_error_count = 0;
const uint8_t BME280_MAX_ERRORS = 3;  // Max consecutive errors before retry

// Simulated data
bool using_simulated_data = false;
float sim_temp = 25.0;
float sim_humidity = 60.0;
uint16_t sim_battery = 120;

void readData() {
    // Try to read from BME280
    bool bme280_ok = false;
    uint32_t now = millis();
    
    // Check if we should retry BME280 initialization
    if (!bme280_available && (now - bme280_last_error) > BME280_RETRY_INIT) {
        initBME280();
    }
    
    if (bme280_available) {
        // Try to read sensor data with timeout protection
        uint32_t read_start = millis();
        temperature = bme.readTemperature();
        humidity = bme.readHumidity();
        uint32_t read_time = millis() - read_start;
        
        // Check for I2C communication timeout (excessive read time)
        if (read_time > 5000) {
            bme280_error_count++;
            Serial1.print(F("[SENSOR] BME280 slow read ("));
            Serial1.print(read_time);
            Serial1.println(F(" ms)"));
        } else {
            // Validate readings (sanity check)
            if (temperature > -50 && temperature < 100 && humidity >= 0 && humidity <= 100) {
                bme280_ok = true;
                bme280_last_read = now;
                bme280_error_count = 0;  // Reset error counter on success
                using_simulated_data = false;
            } else {
                // BME280 returned invalid data
                bme280_error_count++;
                Serial1.print(F("[SENSOR] BME280 invalid data: "));
                Serial1.print(temperature);
                Serial1.print(F(" C, "));
                Serial1.print(humidity);
                Serial1.println(F(" %"));
            }
        }
        
        // If too many consecutive errors, mark as unavailable and retry init
        if (bme280_error_count >= BME280_MAX_ERRORS) {
            bme280_available = false;
            bme280_last_error = now;
            Serial1.println(F("[SENSOR] BME280 errors - will retry init later"));
        }
        
