worrajak/nRF52840/STM32_LoRa_P2P.cpp
        // Also check absolute timeout since last successful read
        if ((now - bme280_last_read) > BME280_TIMEOUT && bme280_last_read > 0) {
            bme280_available = false;
            bme280_last_error = now;
            bme280_error_count = 0;
            Serial1.println(F("[SENSOR] BME280 timeout - using simulated"));
        }
    }
    
    // If BME280 failed, use simulated data
    if (!bme280_ok) {
        using_simulated_data = true;
        
        // Generate realistic simulated values
        temperature = 22.0 + (random(-50, 50) / 100.0);  // 21.5-22.5°C
        humidity = 55.0 + (random(-100, 100) / 100.0);   // 54-56%
        sim_temp = temperature;
        sim_humidity = humidity;
    }
    
    tempC_int = temperature * 10;
    hum_int = humidity * 2;
    
    // Read supply voltage (returns nominal 3300mV - measurement disabled)
    vbat_int = readSupplyVoltage();
    sim_battery = vbat_int;
    
    mydata.temp[0] = tempC_int >> 8;
    mydata.temp[1] = tempC_int;
    mydata.humid[0] = hum_int;
    mydata.vbat[0] = vbat_int >> 8;
    mydata.vbat[1] = vbat_int;

#ifdef DEBUG
    if (using_simulated_data) {
        Serial1.print(F("[SIM] "));
    }
    Serial1.print(temperature);
    Serial1.print(F(" "));
    Serial1.print(humidity);
    Serial1.print(F(" "));
    Serial1.println(vbat_int);
#endif
}

void initBME280() {
    bme280_available = false;
    bme280_error_count = 0;
    
    // Try I2C address 0x77 first
    if (bme.begin(0x77)) {
        bme280_available = true;
        bme280_last_read = millis();
        bme280_last_error = 0;
        Serial1.println(F("[INIT] BME280 OK (0x77)"));
        return;
    }
    
    // Try alternative address 0x76
    if (bme.begin(0x76)) {
        bme280_available = true;
        bme280_last_read = millis();
        bme280_last_error = 0;
        Serial1.println(F("[INIT] BME280 OK (0x76)"));
        return;
    }
    
    // Check if Wire is properly initialized
    Serial1.println(F("[INIT] BME280 NOT FOUND - check I2C connections"));
    bme280_available = false;
    bme280_last_error = millis();
    using_simulated_data = true;
}

// Initialize DS1307 RTC
void initDS1307() {
    rtc_found = false;
    
    if (rtc.begin()) {
        rtc_found = true;
        Serial1.println(F("[INIT] DS1307 RTC OK"));
        
        // Check if RTC is running
        if (!rtc.isrunning()) {
            Serial1.println(F("[WARN] RTC not running - setting time"));
            // Set to compile time
            rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));
        }
        displayRTCTime();
        return;
    }
    
    Serial1.println(F("[INIT] DS1307 RTC NOT FOUND - check I2C connections"));
    rtc_found = false;
}

// Display current time from DS1307
void displayRTCTime() {
    if (!rtc_found) {
        return;
    }
    
    DateTime now = rtc.now();
    
    Serial1.print(F("[RTC] "));
    // Format: YYYY-MM-DD HH:MM:SS
    if (now.year() < 10) Serial1.print("0");
    Serial1.print(now.year());
    Serial1.print("-");
    if (now.month() < 10) Serial1.print("0");
    Serial1.print(now.month());
    Serial1.print("-");
    if (now.day() < 10) Serial1.print("0");
    Serial1.print(now.day());
    Serial1.print(" ");
    if (now.hour() < 10) Serial1.print("0");
    Serial1.print(now.hour());
    Serial1.print(":");
    if (now.minute() < 10) Serial1.print("0");
    Serial1.print(now.minute());
    Serial1.print(":");
    if (now.second() < 10) Serial1.print("0");
    Serial1.println(now.second());
}

// Initialize SD Card
void initSD() {
    sd_found = false;
    
    // Use Software SPI to avoid conflict with LoRa
    // CS=PA4, MOSI=PA7, MISO=PA6, SCK=PA5
    pinMode(SD_CS_PIN, OUTPUT);
    digitalWrite(SD_CS_PIN, HIGH);
    
    // Try EIGHTH_SPEED first (slowest, most reliable), then QUARTER_SPEED
    if (sd.begin(SD_CS_PIN, SPI_EIGHTH_SPEED)) {
        sd_found = true;
        Serial1.println(F("[SD] OK (EIGHTH_SPEED)"));
    } else if (sd.begin(SD_CS_PIN, SPI_QUARTER_SPEED)) {
        sd_found = true;
        Serial1.println(F("[SD] OK (QUARTER_SPEED)"));
    } else {
        Serial1.println(F("[SD] NOT FOUND"));
        return;
    }
    
    // Write header if file is new
    if (!sd.exists(logFilename)) {
        logFile.open(logFilename, O_WRONLY | O_CREAT);
        if (logFile) {
            logFile.println(F("Timestamp,Type,Node,RSSI,Temp,Humidity,Battery,Message"));
            logFile.close();
        }
    }
}

// Add data to ping-pong buffer
void logDataToBuffer(const char* type, const char* data) {
    if (!rtc_found || activeBuffer->recordCount >= MAX_RECORDS) {
        return;
    }
    
    // Get current timestamp
    DateTime now = rtc.now();
    LogRecord* record = &activeBuffer->records[activeBuffer->recordCount];
    
    // Format timestamp: YYYY-MM-DD HH:MM:SS
    snprintf(record->timestamp, sizeof(record->timestamp),
             "%04d-%02d-%02d %02d:%02d:%02d",
             now.year(), now.month(), now.day(),
             now.hour(), now.minute(), now.second());
    
    // Copy type and data
    strncpy(record->type, type, sizeof(record->type) - 1);
    record->type[sizeof(record->type) - 1] = '\0';
    
    strncpy(record->data, data, sizeof(record->data) - 1);
    record->data[sizeof(record->data) - 1] = '\0';
    
    activeBuffer->recordCount++;
    
    // Check if buffer is full - if so, trigger swap
    if (activeBuffer->recordCount >= MAX_RECORDS) {
        activeBuffer->full = true;
        bufferSwapNeeded = true;
    }
}

// Swap active and standby buffers
void swapBuffers() {
    PingPongBuffer* temp = activeBuffer;
    activeBuffer = standbyBuffer;
    standbyBuffer = temp;
    activeBuffer->recordCount = 0;
    activeBuffer->full = false;
}

// Write buffer contents to SD card
void writeBufferToSD() {
    if (!sd_found || standbyBuffer->recordCount == 0) {
        return;
    }
    
    // Open log file in append mode
    logFile.open(logFilename, O_WRONLY | O_APPEND);
    if (!logFile) {
        Serial1.println(F("[SD] Failed to open file"));
        return;
    }
    
    // Write all records from standby buffer
    for (uint8_t i = 0; i < standbyBuffer->recordCount; i++) {
        LogRecord* record = &standbyBuffer->records[i];
        logFile.print(record->timestamp);
        logFile.print(",");
        logFile.print(record->type);
        logFile.print(",");
        logFile.println(record->data);
    }
    
    logFile.close();
    
    Serial1.print(F("[SD-LOG] Wrote "));
    Serial1.print(standbyBuffer->recordCount);
    Serial1.println(F(" records"));
    
    // Clear standby buffer
    standbyBuffer->recordCount = 0;
    standbyBuffer->full = false;
}

// Legacy function for compatibility
void logDataToSD(const char* dataType, const char* message) {
    // Now just calls the buffer-based logging
    char fullMsg[80];
    snprintf(fullMsg, sizeof(fullMsg), "%s,%s", dataType, message);
    logDataToBuffer(dataType, message);
}

