worrajak/nRF52840/STM32_LoRa_P2P.cpp
void setup_vdd_sensor() {
    // Configure ADC reference voltage to VREF (3.3V internal)
    // This enables accurate measurement of internal VBAT
    // For STM32: use DEFAULT reference (VREF = VDDA = 3.3V)
    
    // Enable temperature sensor and VBAT for ADC
    // For STM32F103, we just need to start reading to enable VBAT channel
    delay(10);
}

// Check actual Flash size of STM32
void check_flash_size() {
    // Read Flash Size register at 0x1FFFF7E0
    uint16_t flash_size = *(__IO uint16_t*)(0x1FFFF7E0);
    
    Serial1.print(F("STM32 Flash Size: "));
    Serial1.print(flash_size);
    Serial1.println(F(" KB"));
    
    if (flash_size == 128) {
        Serial1.println(F("*** 128KB Flash detected! ***"));
        Serial1.println(F("You can use more memory by changing platformio.ini"));
    } else if (flash_size == 64) {
        Serial1.println(F("64KB Flash (official spec)"));
    } else {
        Serial1.print(F("Unusual flash size: "));
        Serial1.println(flash_size);
    }
}

// Exponential Backoff with Jitter (CSMA/CA-like)
uint16_t calculateBackoff() {
    // Exponential backoff: BASE_BACKOFF * 2^retryCount + random jitter
    uint16_t backoff = BASE_BACKOFF * (1 << retryCount);  // 2^retryCount
    uint16_t jitter = random(0, backoff);  // Random jitter (0 to backoff)
    uint16_t totalBackoff = backoff + jitter;
    
    Serial1.print(F("[BACKOFF] Retry "));
    Serial1.print(retryCount);
    Serial1.print(F(" - Waiting "));
    Serial1.print(totalBackoff);
    Serial1.println(F(" ms"));
    
    return totalBackoff;
}

// Channel Activity Detection - Check if channel is clear before transmit
bool isChannelClear() {
    // Temporarily disabled - use direct transmission for testing
    // CAD can be enabled later when system is stable
    
    // Option 1: Always return true (skip CAD)
    return true;
    
    /* Option 2: Use proper RSSI reading (uncomment when needed)
    // Read current RSSI properly
    int currentRSSI = rf95.rssiRead();
    
    Serial1.print(F("[CAD] Current RSSI: "));
    Serial1.println(currentRSSI);
    
    // If RSSI is stronger than -90 dBm, channel might be busy
    if (currentRSSI > -90) {
        Serial1.println(F("[CAD] Channel busy"));
        return false;
    }
    return true;
    */
}

// Check if message was already relayed (Duplicate Detection)
bool isMessageDuplicate(uint8_t sourceNode, uint8_t seqNum) {
    for (int i = 0; i < RELAY_MEMORY_SIZE; i++) {
        if (relayMemory[i].sourceNode == sourceNode && relayMemory[i].sequenceNum == seqNum) {
            // Check if it's still within the "remember" window (5 minutes)
            uint32_t ageInSeconds = (millis() - relayMemory[i].timestamp) / 1000;
            if (ageInSeconds < 300) {  // 5 minutes = 300 seconds
                return true;  // This is a duplicate
            }
        }
    }
    return false;  // Not a duplicate
}

// Add message to relay cache
void addToRelayCache(uint8_t sourceNode, uint8_t seqNum) {
    relayMemory[relayCacheIndex].sourceNode = sourceNode;
    relayMemory[relayCacheIndex].sequenceNum = seqNum;
    relayMemory[relayCacheIndex].timestamp = millis();
    
    // Move to next cache slot (circular buffer)
    relayCacheIndex = (relayCacheIndex + 1) % RELAY_MEMORY_SIZE;
}

// Add message to queue with random delay (1-3 seconds)
void addToMessageQueue(uint8_t* buf, uint8_t len) {
    // Find empty slot in queue
    for (int i = 0; i < MESSAGE_QUEUE_SIZE; i++) {
        if (!messageQueue[i].inUse) {
            // Copy message to queue
            memcpy(messageQueue[i].data, buf, len);
            messageQueue[i].len = len;
            
            // Calculate send time: random 1-3 seconds from now
            uint32_t delayMs = 1000 + random(2000);  // 1000-3000 ms
            messageQueue[i].sendTime = millis() + delayMs;
            messageQueue[i].inUse = true;
            
            Serial1.print(F("[QUEUE] Added msg, delay: "));
            Serial1.print(delayMs);
            Serial1.println(F(" ms"));
            return;
        }
    }
    
    Serial1.println(F("[QUEUE] FULL - message dropped"));
}

// Sanitize payload - remove garbage characters and duplicate headers
String sanitizePayload(String input) {
    String clean = "";
    
    // Remove non-printable characters
    for (int i = 0; i < input.length(); i++) {
        char c = input[i];
        if (c >= 32 && c <= 126) {  // Printable ASCII only
            clean += c;
        } else {
            break;  // Stop at first garbage character
        }
    }
    
    // Check for repeated "N:" header (concatenated messages)
    int firstN = clean.indexOf("N:");
    if (firstN != -1) {
        int secondN = clean.indexOf("N:", firstN + 2);
        if (secondN != -1) {
            // Truncate before second header
            clean = clean.substring(0, secondN);
        }
    }
    
    return clean;
}

// Process message queue - send delayed messages
void processMessageQueue() {
    uint32_t now = millis();
    
    for (int i = 0; i < MESSAGE_QUEUE_SIZE; i++) {
        if (messageQueue[i].inUse && now >= messageQueue[i].sendTime) {
            // Time to send this message
            Serial1.print(F("[QUEUE] Sending queued message "));
            Serial1.println(i);
            
            // Send the message
            if (manager.sendtoWait(messageQueue[i].data, messageQueue[i].len, BROADCAST_ADDRESS)) {
                Serial1.println(F("[QUEUE] Sent OK"));
            } else {
                Serial1.println(F("[QUEUE] Send Failed"));
            }
            
            // Mark slot as unused
            messageQueue[i].inUse = false;
        }
    }
}

// Transmit data with Collision Avoidance and Sequence Number
void transmitData() {
    // CHECK RX PRIORITY: Don't transmit if receiver is busy
    if (isRxBusy) {
        Serial1.println(F("[TX-HOLD] RX busy..."));
        return;  // Skip TX, try again next loop
    }
    
    readData();
    
    // Display current date/time when sending data
    displayRTCTime();
    
