worrajak/nRF52840/STM32_LoRa_P2P.cpp
    // Create payload string in simplified P2P format: N:NODE|S:SEQ|T:TEMP|H:HUM|B:BAT
    // This format is compatible with Node 108 (PZEM) for unified mesh
    String payload = "";
    payload += "N:";
    payload += THIS_NODE_ADDRESS;  // Node ID (104)
    payload += "|S:";
    payload += txSequenceNum;      // Sequence Number
    
    // Add BME280 temperature (as integer)
    payload += "|T:";
    payload += (int)temperature;
    
    // Add BME280 humidity (as integer)
    payload += "|H:";
    payload += (int)humidity;
    
    // Add battery voltage
    payload += "|B:";
    payload += vbat_int;
    
    // Debug: Show plaintext before encryption
    Serial1.print(F("[TX "));
    Serial1.print(THIS_NODE_ADDRESS);
    Serial1.print(F("] Plaintext: "));
    Serial1.println(payload);
    
    // Encrypt data using XOR
    int payloadLen = payload.length();
    uint8_t txbuf[payloadLen + 2];  // +2 for CRC
    encrypt_data(payload.c_str(), payloadLen, txbuf);
    
    // Debug: Show encrypted length
    Serial1.print(F("  Encrypted length: "));
    Serial1.println(payloadLen);
    
    // Calculate CRC16 checksum on encrypted data
    uint16_t crc = calculateCRC16(txbuf, payloadLen);
    
    // Append CRC16 (2 bytes)
    txbuf[payloadLen] = (crc >> 8) & 0xFF;      // High byte
    txbuf[payloadLen + 1] = crc & 0xFF;         // Low byte
    
    uint16_t totalLen = payloadLen + 2;
    
    // Retry logic with backoff
    retryCount = 0;
    bool txSuccess = false;
    
    while (retryCount <= MAX_RETRIES && !txSuccess) {
        // Random jitter before transmission (0-500ms)
        uint16_t preDelay = random(0, 500);
        delay(preDelay);
        
        // Check if channel is clear before sending
        if (isChannelClear()) {
            Serial1.print(F("  Sending..."));
            
            if (using_simulated_data) {
                Serial1.print(F(" [SIM]"));
            }
            Serial1.println();
            
            // Send to broadcast address (all nodes receive)
            if (manager.sendtoWait(txbuf, totalLen, BROADCAST_ADDRESS)) {
                // Success!
                Serial1.print(F("  [OK] Seq "));
                Serial1.println(txSequenceNum);
                
                // Log to buffer (non-blocking)
                char logMsg[100];
                snprintf(logMsg, sizeof(logMsg), "TX,%d,N/A,%d,%d,%s", 
                         THIS_NODE_ADDRESS, (int)temperature, (int)humidity, (using_simulated_data ? "SIM" : "BME"));
                logDataToBuffer("TRANSMIT", logMsg);
                
                // Blink LED 1 time for successful transmission
                digitalWrite(led, LOW);
                delay(100);
                digitalWrite(led, HIGH);
                
                txSuccess = true;
                txSequenceNum++;  // Increment for next transmission
                retryCount = 0;   // Reset for next transmission
            } else {
                // Timeout or no ACK - backoff and retry
                retryCount++;
                if (retryCount <= MAX_RETRIES) {
                    uint16_t backoffTime = calculateBackoff();
                    delay(backoffTime);
                } else {
                    Serial1.println(F("  [FAIL] Max retry"));
                }
            }
        } else {
            // Channel busy - wait and retry
            retryCount++;
            if (retryCount <= MAX_RETRIES) {
                uint16_t backoffTime = calculateBackoff();
                delay(backoffTime);
            } else {
                Serial1.println(F("  [FAIL] Ch busy"));
            }
        }
    }
    
    lastTxTime = millis();
}

// Receive and process incoming data
void receiveData() {
    if (manager.available()) {
        // Mark that we're receiving - this will block TX during RX
        isRxBusy = true;
        rxStartTime = millis();
        
        uint8_t len = sizeof(rxbuf);
        uint8_t from;
        
        if (manager.recvfromAck(rxbuf, &len, &from)) {
            int rssi = rf95.lastRssi();
            
            // Verify CRC16 checksum (last 2 bytes)
            if (len < 2) {
                isRxBusy = false;
                return;
            }
            
            uint16_t receivedCRC = ((uint16_t)rxbuf[len - 2] << 8) | rxbuf[len - 1];
            uint16_t calculatedCRC = calculateCRC16(rxbuf, len - 2);
            
            if (receivedCRC != calculatedCRC) {
                return;
            }
            
            // Decrypt the data (excluding CRC bytes)
            int dataLen = len - 2;  // Exclude CRC
            char decrypted[dataLen + 1];  // +1 for null terminator
            decrypt_data(rxbuf, dataLen, decrypted);
            
            // Sanitize payload - remove garbage and duplicate headers
            String decryptedStr = String(decrypted);
            String cleaned = sanitizePayload(decryptedStr);
            bool wasCleaned = (cleaned != decryptedStr);
            
            // If sanitization occurred, re-encrypt and update buffer
            if (wasCleaned) {
                Serial1.println(F("[SANITIZED]"));
                
                // Re-encrypt cleaned payload
                int cleanedLen = cleaned.length();
                encrypt_data(cleaned.c_str(), cleanedLen, rxbuf);
                
                // Recalculate CRC
                uint16_t newCRC = calculateCRC16(rxbuf, cleanedLen);
                
                // Update buffer with CRC
                rxbuf[cleanedLen] = (newCRC >> 8) & 0xFF;
                rxbuf[cleanedLen + 1] = newCRC & 0xFF;
                len = cleanedLen + 2;
                
                // Use cleaned payload
                strncpy(decrypted, cleaned.c_str(), dataLen);
                decrypted[cleaned.length()] = '\0';
                decryptedStr = cleaned;  // Update decryptedStr too
            }
            
            // Parse Node ID and Sequence Number from decrypted payload
            uint8_t sourceNode = 0;
            uint8_t seqNum = 0;
            bool isSim = false;
            
            // Extract Node ID
            int nPos = decryptedStr.indexOf("N:");
            if (nPos != -1) {
                int pipePos = decryptedStr.indexOf("|", nPos);
                if (pipePos != -1) {
                    String nodeStr = decryptedStr.substring(nPos + 2, pipePos);
                    sourceNode = nodeStr.toInt();
                }
            }
            
            // Extract Sequence Number
            int sPos = decryptedStr.indexOf("S:");
            if (sPos != -1) {
                int pipePos = decryptedStr.indexOf("|", sPos);
                if (pipePos != -1) {
                    String seqStr = decryptedStr.substring(sPos + 2, pipePos);
                    seqNum = seqStr.toInt();
                }
            }
            
            // Check if simulated data
            if (decryptedStr.indexOf("SIM|") != -1) {
                isSim = true;
            }
            
            // Display received data
            Serial1.print(F("[RX from:"));
            Serial1.print(from);
            Serial1.print(F(" src:"));
            Serial1.print(sourceNode);
            Serial1.print(F("] S"));
            Serial1.print(seqNum);
            if (isSim) {
                Serial1.print(F(" [SIM]"));
            }
            Serial1.print(F(" RSSI:"));
            Serial1.println(rssi);
            
            // Display decrypted payload
            Serial1.print(F("PAYLOAD: "));
            Serial1.println(decrypted);
            
