worrajak/nRF52840/STM32_LoRa_P2P.cpp
            // Log to buffer (non-blocking)
            char logMsg[150];
            snprintf(logMsg, sizeof(logMsg), "RX,%d,%d,%d,,%s", 
                     sourceNode, from, rssi, (isSim ? "SIM" : "DATA"));
            logDataToBuffer("RECEIVE", logMsg);
            
            // Blink LED 2 times for received message
            for (int i = 0; i < 2; i++) {
                digitalWrite(led, LOW);
                delay(100);
                digitalWrite(led, HIGH);
                delay(100);
            }
            
            // Check for duplicate message
            if (isMessageDuplicate(sourceNode, seqNum)) {
                Serial1.println(F("[DUP-SKIP]"));
                return;
            }
            
            // Add to relay cache
            addToRelayCache(sourceNode, seqNum);
            
            // Forward logic: Forward if RSSI <= -100 (weak to medium signal)
            if (rssi > -100) {
                Serial1.println(F("[SKIP] RSSI>-100"));
            } else {
                // Add message to queue for delayed relay (1-3 seconds random)
                Serial1.print(F("[FWD "));
                Serial1.print(sourceNode);
                Serial1.print(F("] S"));
                Serial1.print(seqNum);
                if (isSim) {
                    Serial1.print(F(" [SIM]"));
                }
                Serial1.println();
                
                // Store message for delayed relay
                uint8_t fwdbuf[len];
                memcpy(fwdbuf, rxbuf, len);
                addToMessageQueue(fwdbuf, len);
            }
        } else {
            // recvfromAck failed
            isRxBusy = false;
        }
    } else {
        // No message available, clear RX busy flag after hold time
        if (isRxBusy && (millis() - rxStartTime) >= RX_HOLD_TIME) {
            isRxBusy = false;
        }
    }
    
    // Failsafe: If stuck in RX state too long, force clear
    if (isRxBusy && (millis() - rxStartTime) > RX_TIMEOUT) {
        Serial1.println(F("[RX-TIMEOUT] Force clear"));
        isRxBusy = false;
    }
}

void setup() {
    setup_vdd_sensor();
    
    // Initialize Serial first
    Serial1.begin(9600);  // 9600 baud, 8-N-1 (8 data bits, No parity, 1 stop bit)
    delay(1000);  // Wait for serial to initialize
    
    // Initialize LED
    pinMode(led, OUTPUT);
    digitalWrite(led, HIGH);  // LED off (active low)
    
    // Blink LED 2 times to indicate board is working
    for (int i = 0; i < 2; i++) {
        digitalWrite(led, LOW);   // LED on
        delay(100);
        digitalWrite(led, HIGH);  // LED off
        delay(100);
    }
    
    Serial1.println(F("\n\n==============================="));
    Serial1.println(F("STM32 LoRa P2P Sensor Node"));
    Serial1.println(F("===============================\n"));
    
    // Check Flash size
    check_flash_size();
    
    // Check for OLED display
    initOLED();
    
    // Initialize SPI with SPI2 pins (for LoRa)
    SPI.setMOSI(PB15);
    SPI.setMISO(PB14);
    SPI.setSCLK(PB13);
    SPI.begin();
    pinMode(RFM95_INT, INPUT);
    
    // Initialize LoRa radio
    pinMode(RFM95_RST, OUTPUT);
    digitalWrite(RFM95_RST, HIGH);
    delay(100);
    digitalWrite(RFM95_RST, LOW);
    delay(10);
    digitalWrite(RFM95_RST, HIGH);
    delay(100);
    
    if (!manager.init()) {
        Serial1.println(F("[ERR] LoRa init failed - check wiring"));
        while (1) {
            digitalWrite(led, LOW);
            delay(100);
            digitalWrite(led, HIGH);
            delay(100);
        };
    }
    Serial1.println(F("[LoRa] OK"));
    
    // Apply configuration
    rf95.setFrequency(loraConfig.freq / 1000000.0);  // Convert Hz to MHz
    rf95.setSpreadingFactor(loraConfig.spreadingFactor);
    rf95.setSignalBandwidth(loraConfig.bandwidth);
    rf95.setCodingRate4(loraConfig.codingRate - 4);
    rf95.setTxPower(loraConfig.txPower, false);
    
    // Print configuration
    printLoRaConfig();
    
    // Initialize BME280 sensor with custom I2C pins
    Wire.setSDA(PB7);
    Wire.setSCL(PB6);
    Wire.begin();
    delay(100);
    
    // Initialize BME280 sensor
    initBME280();
    
    // Initialize DS1307 RTC
    initDS1307();
    
    // Initialize SD Card
    initSD();
    
    lastTxTime = millis();
    
#ifdef DEBUG
    Serial1.println(F("Setup complete - entering main loop"));
#endif
}

void loop() {
    // *** RX HAS PRIORITY - Process incoming messages FIRST ***
    // Check for incoming messages (IMPORTANT: Keep this first for relay functionality)
    receiveData();
    
    // Process message queue - send delayed relay messages
    processMessageQueue();
    
    // Check if it's time to transmit (only if RX is not busy)
    if (millis() - lastTxTime >= txInterval * 1000) {
        transmitData();
    }
    
    // Ping-pong buffer management: Swap and flush when buffer is full
    if (bufferSwapNeeded) {
        // Don't write immediately; let it happen in background when not busy
        static unsigned long lastBufferCheck = 0;
        if (millis() - lastBufferCheck >= 500) {  // Check every 500ms
            swapBuffers();                          // Exchange active and standby buffers
            writeBufferToSD();                       // Flush standby buffer to SD in one operation
            lastBufferCheck = millis();
        }
    }
    
    // Display current time every 60 seconds
    static unsigned long lastTimeDisplay = 0;
    if (millis() - lastTimeDisplay >= 60000) {
        displayRTCTime();
        lastTimeDisplay = millis();
    }
    
    // Minimal delay - reduced to save power while still allowing RX interrupt
    delay(10);  // Very short delay to reduce power consumption
}

// GPS functions (stubbed out)
static void gpsdump() {
    // GPS dump function stub
}

static bool feedgps() {
    // GPS feed function placeholder
    return false;
}

